# 1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
# Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды,
# третьего (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только
# в указанном порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.
from itertools import cycle
import time

class TrafficLight:
    def __init__(self):
        self.color = {'красный': 7, 'желтый': 2, 'зеленый': 5}

    def running(self):
        for c in cycle(self.color.keys()):
            print(c)
            time.sleep(self.color[c])


tlight = TrafficLight()
tlight.running()
